Revit 2027 API
CompoundStructure.IsEqual Method
 Checks whether this CompoundStructure is the same as another CompoundStructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	CompoundStructure otherStructure
)
Public Function IsEqual (
	otherStructure As CompoundStructure
) As Boolean
public:
bool IsEqual(
	CompoundStructure^ otherStructure
)
member IsEqual :
        otherStructure : CompoundStructure -> bool
Parameters
otherStructure CompoundStructure
 A CompoundStructure.
Return Value
Boolean
 True if the two CompoundStructures are the same, and false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace